# Алгоритм решения итоговой задачи по первому симестру

_**Задача:** Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами._

1. Создаем массив с элементами текста
```sh
string[] textList = {"Hello", "224", "world", ":-)", "try", "ui"};
```

2. Создаем функцию по поиску количества элелентов массива длинной меньше, либо равно 3. Функция возвращает количество элементов массива длинной меньше, либо равно 3.

```sh
int CountSymbol (string[] textList) {
    int count = 0;
    for (int i=0; i < textList.Length; i++){
        if (textList[i].Length <= 3) {
            count ++;
        }
    }
    return count;
}
```

3. Создаем массив элементов длинной равной количеству элементов массива длинной меньше, либо равно 3.

```sh
string[] textListLen3 = new string[CountSymbol(textList)];
```

4. Создаем функцию заполенния массива элементами

```sh
void AddStringToList (){
    int j = 0;
     for (int i=0; i < textList.Length; i++){
        if (textList[i].Length <= 3) {
            textListLen3[j] = textList[i];
            j++;
        }
    }
}
```

5. Вызываем функцию
```sh
AddStringToList();
```

6. Выводим на печать результат работы функции
```sh
System.Console.WriteLine($"['{string.Join("', '", textListLen3)}']");
```